Autodesk.Revit.DB.DesktopConnectorVerboseOptions.GetDesktopConnectorVerboseOptions
Returns the current user's DesktopConnectorVerboseOptions.
Returns:
The DesktopConnectorVerboseOptions for the current user.
Since:
2022

Autodesk.Revit.DB.DesktopConnectorVerboseOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DesktopConnectorVerboseOptions.DesktopConnectorVerboseMode
Returns whether the user wants Desktop Connector verbose mode.
Since:
2022

Autodesk.Revit.DB.DesktopConnectorVerboseOptions.#ctor
Since:
2022

Autodesk.Revit.DB.DesktopConnectorVerboseOptions
A utility class containing the Revit.ini options settings related to Desktop Connector Verbose mode for journal debugging
Since:
2022